[
    {
        "rank": 1,
        "title": "Ordinary",
        "artist": "Alex Warren",
        "lyrics": "They say, \"The holy water's watered down\nAnd this town's lost its faith\nOur colors will fade eventually\"\nSo if our time is runnin' out\nDay after day\nWe'll make the mundane our masterpiece\nOh my, my\nOh my, my love\nI take one look at you\nYou're takin' me out of the ordinary\nI want you layin' me down 'til we're dead and buried\nOn the edge of your knife, stayin' drunk on your vine\nThe angels up in the clouds are jealous, knowin' we found\nSomethin' so out of the ordinary\nYou got me kissin' the ground of your sanctuary\nShatter me with your touch, oh Lord, return me to dust\nThe angels up in the clouds are jealous, knowin' we found\nHopeless Hallelujah\nOn this side of Heaven's gate\nOh, my life, how do ya\nBreathe and take my breath away?\nAt your altar, I will pray\nYou're the sculptor, I'm the clay\nOh my, my\nYou're takin' me out of the ordinary\nI want you layin' me down 'til we're dead and buried\nOn the edge of your knife, stayin' drunk on your vine\nThe angels up in the clouds are jealous, knowin' we found\nSomethin' so out (out) of the ordinary (ordinary)\nYou got me kissin' the ground (ground) of your sanctuary (sanctuary)\nShatter me with your touch, oh Lord, return me to dust\nThe angels up in the clouds are jealous, knowin' we found\nSomethin' so heavenly, higher than ecstasy\nWhenever you're next to me, oh my, my\nWorld was in black and white until I saw your light\nI thought you had to die to find\nSomethin' so out of the ordinary\nI want you layin' me down 'til we're dead and buried\nOn the edge of your knife, stayin' drunk on your vine\nThe angels up in the clouds are jealous, knowin' we found\nSomethin' so out (out) of the ordinary\nYou got me kissin' the ground (ground) of your sanctuary (sanctuary)\nShatter me with your touch, oh Lord, return me to dust\nThe angels up in the clouds are jealous, knowin' we found"
    },
    {
        "rank": 2,
        "title": "Daisies",
        "artist": "Justin Bieber",
        "lyrics": "Throwing pedals like do you love me or not\nHead is spinning and it don't know when to stop\nCause you said forever babe did you mean it or not\nHold on hold on\nYou leave me on read babe but I still get the message\nInstead of a line its 3 dots but I can connect em\nAnd if it ain't right babe\nYou know I respect it\nBut if you need time just take your time\nHoney I get it I get it I get it\nThe way you got me all in my head\nThink I'd rather you in my bed\nWhatever it is you know I can take it\nI'm counting the days how many days\nTil I can see you again\nBlowing kisses like will you catch 'em or not\nI'm Cupid with arrows babe I'm just shooting my shot mhmm\nIf I could get in drop me a pin\nHop in the — and come over\nDon't wanna be friends just skin to skin\nI wanna get closer and closer and closer\nThe way you got me all in my head\nThink I'd rather you in my bed\nWhatever it is you know I can take it\nI'm counting the days how many days\nTil I can see you again\nYou got me all in my feelings\nAnd you got me all I've been all in my feelings\nAnd you got me all weak in my knees every time\nCause you got me all, all in my feelings\nThe way you got me all in my head\nThink I'd rather you in my bed\nWhatever it is you know I can take it\nI'm counting the days how many days\nTil I can see you again"
    },
    {
        "rank": 3,
        "title": "Love Me Not",
        "artist": "Ravyn Lenae",
        "lyrics": "See, right now, I need you, I'll meet you somewhere now\nYou up now, I see you, I get you, take care now\nSlow down, be cool, I miss you, come here now\nIt's yours now, keep it, I'll hold out until now\nI need you right now, once I leave you I'm strung out\nIf I get you, I'm slowly breaking down\nAnd, oh, it's hard to see you, but I wish you were right here\nOh, it's hard to leave you when I get you everywhere\nAll this time I'm thinking we could never be a pair\nOh, no, I don't need you, but I miss you, come here\nAnd, oh, it's hard to see you, but I wish you were right here\nOh, it's hard to leave you when I get you everywhere\nAll this time, I'm thinking I'm strong enough to sink it\nOh, no, I don't need you, but I miss you, come here\nHe love me not, he loves me\nHe holds me tight then lets me go\nHe love me not, he loves me\nHe holds me tight then lets me go\nSoon as you leave me, we always lose connection\nIt's gettin' messy, I fiend for your affection\nDon't loosen your grip, got a hold on me\nNow, forever, let's get back together\nLord, take it so far away\nI pray that, God, we don't break\nI want you to take me up and down\nAnd 'round and 'round again\nAnd, oh, it's hard to see you, but I wish you were right here\nOh, it's hard to leave you when I get you everywhere\nAll this time I'm thinking we could never be a pair\nOh, no, I don't need you, but I miss you, come here\nAnd, oh, it's hard to see you but I wish you were right here\nOh, it's hard to leave you when I get you everywhere\nAll this time, I'm thinking I'm strong enough to sink it\nOh, no, I don't need you, but I miss you, come here\nHe love me not, he loves me\nHe holds me tight then lets me go\nHe love me not, he loves me\nHe holds me tight then lets me go\nHe love me not, he loves me\nHe holds me tight then lets me go\nHe love me not, he loves me\nHe holds me tight then lets me go\nYou gotta say that you're sorry at the end of the night\nWake up in the morning, everything's alright\nAt the end of the story, you're holdin' me tight\nI don't need to worry, am I out of my mind?\nAnd, oh, it's hard to see you, but I wish you were right here (I'm losing my mind)\nOh, it's hard to leave you when I get you everywhere\nAll this time I'm thinking, I'm strong enough to sink it\nOh, no, I don't need you, but I miss you, come here"
    },
    {
        "rank": 4,
        "title": "Undressed",
        "artist": "sombr",
        "lyrics": "You had a dream, you wanted better\nYou were sick of all the holes in your sweater\nYou looked to me and wondered whether\nI was the lamppost to which you were tethered\nI'm lookin' at you, and you're lookin' at me\nBut the glimmer in your eyes is sayin' you wanna leave\nYou say you don't mean what you're sayin' to me\nBut the glimmer in your eyes is telling me other things\nI don't wanna get undressed\nFor a new person all over again\nI don't wanna kiss someone else's neck\nAnd have to pretend it's yours instead\nI took the train to see my mother\nI look across the track to see you with another\nThere's nothin' worse than seein' your lover\nMoving on while you still suffer\nI'm lookin' at you, and you're lookin' at me\nBut the glimmer in your eyes is sayin' you wanna leave\nYou say you don't mean what you're sayin' to me\nBut the glimmer in your eyes is tellin' me other things\nI don't wanna get undressed\nFor a new person all over again\nI don't wanna kiss someone else's neck\nAnd have to pretend it's yours instead\nAnd I don't wanna learn another scent\nI don't want the children of another man\nTo have the eyes of the girl that I won't forget\nI won't forget\nI don't wanna get undressed\nFor a new person all over again\nI don't wanna kiss someone else's neck\nAnd have to pretend it's yours instead\nI don't wanna get undressed\nFor a new person all over again"
    },
    {
        "rank": 5,
        "title": "Golden",
        "artist": "HUNTR/X: EJAE, Audrey Nuna & REI AMI",
        "lyrics": "I was a ghost, I was alone (hah)\n어두워진 앞길 속에 (hah)\nGiven the throne, I didn't know how to believe\nI was the queen that I'm meant to be\nI lived two lives, tried to play both sides\nBut I couldn't find my own place\nCalled a problem child 'cause I got too wild\nBut now that's how I'm getting paid 끝없이 on stage\nI'm done hidin', now I'm shinin' like I'm born to be\nWe dreamin' hard, we came so far, now I believe\nWe're goin' up, up, up, it's our moment\nYou know together we're glowin'\nGonna be, gonna be golden\nOh-oh-oh, up, up, up with our voices\n영원히 깨질 수 없는\nGonna be, gonna be golden\nOh-oh-oh, I'm done hidin', now I'm shinin' like I'm born to be\nOh, our time, no fears, no lies\nThat's who we're born to be\nWaited so long to break these walls down\nTo wake up and feel like me\nPut these patterns all in the past now\nAnd finally live like the girl they all see\nNo more hiding, I'll be shinin' like I'm born to be\n'Cause we are hunters, voices strong, and I know I believe\nWe're goin' up, up, up, it's our moment\nYou know together we're glowin'\nGonna be, gonna be golden\nOh-oh-oh, up, up, up with our voices\n영원히 깨질 수 없는\nGonna be, gonna be golden\nOh-oh-oh, I'm done hidin', now I'm shinin' like I'm born to be\nOh, our time, no fears, no lies\nThat's who we're born to be\nYou know we're gonna be, gonna be golden\nWe're gonna be, gonna be\nBorn to be, born to be glowin'\n밝게 빛나는 우린\nYou know that it's our time, no fears, no lies\nThat's who we're born to be"
    },
    {
        "rank": 6,
        "title": "What I Want",
        "artist": "Morgan Wallen Featuring Tate McRae",
        "lyrics": "She said, \"You don't want this heart, boy, it's already broke\"\nTold me everything she touch just goes up in smoke\nOnly stay a couple nights, then she gon' be gone\nI said, \"Baby, you should know that's what I want\"\nThat's what I want, that's what I want\nThat's what I want, that's what I want, that's what I want\nWhat I want\n\nAnd you ain't gotta worry 'bout no trust issues with me\nI got 'em too, I got 'em too\nYou ain't gotta worry 'bout no exes that's crazy\nI got 'em too, you know I do\n\nIf you're in a hurry\nNah, you ain't gonna hurt me tonight\nAnd it won't be the worst thing\nIf this is all it is\nAnd in the middle of a kiss\n\nShe said, \"You don't want this heart, boy, it's already broke\"\nTold me everything she touch just goes up in smoke\nOnly stay a couple nights, then she gon' be gone\nI said, \"Baby, you should know that's what I want\"\nThat's what I want, that's what I want\nThat's what I want, that's what I want, that's what I want\nThat's what I want\nThat's what I want\nWhat I want\n\nThere are no hard feelings if you only wanna act like lovers do\nFor a night or two\nOoh, oh yeah\nAnd sometimes in the mornin' go back to bein' someone you never knew\nYou never knew\n\nBaby, don't you worry, you ain't gonna hurt me tonight\nIt won't be the worst thing\nIf this is all it is\nThen she kissed me again\n\nAnd said, \"You don't want this heart, boy, it's already broke\"\nTold me everything she touch just goes up in smoke\nOnly stay a couple nights, then she gon' be gone\nI said, \"Baby, you should know that's what I want\"\n\nShe said, \"You don't want this heart, nah, it can't be fixed\nAnd I ain't ready to try on a night like this\nBut if you still wanna stay, there ain't nothin' wrong\"\nThere's nothin' wrong\nI said, \"Baby, you should know that's what I want\"\nThat's what I want, that's what I want\nThat's what I want, that's what I want, that's what I want\nThat's what I want\nYeah\nThat's what I want, that's what I want, that's what I want\nYeah\nThat's what I want\nOh yeah, oh\nThat's what I want, that's what I want\n"
    },
    {
        "rank": 7,
        "title": "Manchild",
        "artist": "Sabrina Carpenter",
        "lyrics": "You said your phone was broken, just forgot to charge it\nWhole outfit you're wearing, God, I hope it's ironic\nDid you just say you're finished? Didn't know we started\nIt's all just so familiar, baby, what do you call it?\n\nStupid\nOr is it slow?\nMaybe it's useless?\nBut there's a cuter word for it, I know\n\nMan-child\nWhy you always come a-running to me?\nFuck my life\nWon't you let an innocent woman be?\nNever heard of self-care\nHalf your brain just ain't there\nMan-child\nWhy you always come a-running, taking all my loving from me?\n\nWhy so sexy if so dumb?\nAnd how survive the Earth so long?\nIf I'm not there, it won't get done\nI choose to blame your mom\n\nMan-child\nWhy you always come a-running to me?\nFuck my life\nWon't you let an innocent woman be?\nNever heard of self-care\nHalf your brain just ain't there\nMan-child\nWhy you always come a-running, taking all my loving from me?\n\nOh, I like my boys playing hard to get\nAnd I like my men all incompetent\nAnd I swear they choose me, I'm not choosing them\nAmen, hey, men\nOh, I like my boys playing hard to get (Play hard to get)\nAnd I like my men all incompetent (Incompetent)\nAnd I swear they choose me, I'm not choosing them (Not choosing them)\nAmen (Amen), hey, men (Hey, men)\n\nMan-child\nWhy you always come a-running to me? (Always come a-running to me)\nFuck my life\nWon't you let an innocent woman be? (Amen)\n\nOh, I like my boys playing hard to get (Play hard to get)\nAnd I like my men all incompetent (Incompetent)\nAnd I swear they choose me, I'm not choosing them (Not choosing them)\nAmen (Amen), hey, men (Hey, men) "
    },
    {
        "rank": 8,
        "title": "Mystical Magical",
        "artist": "Benson Boone",
        "lyrics": "There's nothing colder than your shoulder\nWhen you're dragging me along\nLike you do, like you do\nAnd then you switch up with no warning\nAnd you kiss me like you want it\nHow rude, how rude\nBut I kinda like it anyways\nI don't mind if this is gonna take a million days\nI know you'll come around to me eventually\nIf you sit back, relax, enjoy my company\nMy company\nOnce you know what my love's gonna feel like\nNothing else will feel right\nYou can feel like\nMoonbeam ice cream\nTaking off your blue jeans\nDancing at the movies\n'Cause it feels so mystical, magical, oh, baby\n'Cause once you know, once you know\nMy love is so mystical, magical, oh, baby\n'Cause once you know, once you know\nMy little hard-to-get baby\nI want to give you the world (ooh)\nNot saying you gotta chase me\nBut I wouldn't mind it\nIf you gave me just a little bit of\nSomething we can work it with\nBut all you do is push me out\nBut I like it anyways\n'Cause I think I'm getting closer to you every day\nI know you'll come around to me eventually\nJust sit back, relax, enjoy my company\nOh, baby, trust me\nOnce you know what my love's gonna feel like\nNothing else will feel right\nYou can feel like\nMoonbeam ice cream\nTaking off your blue jeans\nDancing at the movies\n'Cause it feels so mystical, magical, oh, baby\n'Cause once you know, once you know\nMy love is so mystical, magical, oh, baby\n'Cause once you know, once you know (ooh)\nOnce you know what my love's gonna feel like (ooh, ooh)\nMoonbeam ice cream, nothing else will feel right (ooh)\nMystical, magical, oh, baby\nIt's mystical, magical"
    },
    {
        "rank": 9,
        "title": "Revolving Door",
        "artist": "Tate McRae",
        "lyrics": "My cold heart is finally melting\nI moved from the east to the west wing\nI finally think it might be helping, oh, oh\nI confess, I'm not that versatile\nSay I'm good, but I might be in denial\nTakes one call and that undoes the dial (Ah)\n\nBaby, I tried to call you\nOff like a bad habit\nTried to call you\nOff like a bad habit\n\nBut I keep comin' back like a revolvin' door\nSay I couldn't want you less, but I just want you more\nSo I keep comin' back like a revolvin' door\nSay I couldn't want you less, but I just want you more\n\nAnd more, and more\nAnd more, more (More)\nAnd more, and more\nAnd more, more (More)\n\nShut it down\nThat I try (Hey), then you come, come around\nFuck me good, fuck me up, then I gotta move towns\nHow'd I get from your gym to your couch? Oh, how?\n\nBaby, I tried to (Tried to) call you (Call you)\nOff like a bad habit (Yeah)\nTried to (Tried to) call you (Call you)\nOff like a bad habit\n\nBut I keep comin' back (Oh no) like a revolvin' door (Yeah)\nSay I couldn't want you less, but I just want you more\nSo I keep comin' back (Oh no) like a revolvin' door (Yeah)\nSay I couldn't want you less, but I just want you more\n\nAnd more (Get what I want), and more (Can't get enough of)\nAnd more (You, when you make me), more (More)\nAnd more (Get what I want), and more (Can't get enough of)\nAnd more (You, when you make me), more (More)\n\nChange my mind so much I can't find it\nI work so much, can't be reminded\nLife feels worse, but good with you in it\nSupposed to be on stage, but fuck it, I need a minute\nChange my mind so much it's exhaustin'\nI still think 'bout that night out in Boston\nI'm more hurt than I would admit\nI'm supposed to be an adult, but fuck it, I need a minute (Oh)\n\nI need a minute, I need a minute (Ooh)\nI need a, I need, fuck it, I need a minute (I need a)\nI need a minute, I need a minute (Yeah)\nI need a, I need, fuck it, I need a minute\n\nI need a minute\nOoh, I need a minute\nMm\nMm"
    },
    {
        "rank": 10,
        "title": "Mutt",
        "artist": "Leon Thomas",
        "lyrics": "Oh, ooh\nOh\nShe said, \"Take your time, what's the rush?\"\nI said, \"Baby, I'm a dog, I'm a mutt\"\nShe said, \"Take your time, what's the rush?\" Oh\nI said, \"Baby, I'm a dog, I'm a mutt\"\nI'm a dog, I'm a mutt\nI can't smoke on reggie, so pardon my bluntness\nI see past pretty faces, so I got trouble trusting\nBut I'll let my guard down for you\nSaid I'll put my guard down for you\nSaid I'll be vulnerable\nSo you can break my heart if you want to\nShe said, \"Take your time, what's the rush?\"\nI said, \"Baby, I'm a dog, I'm a mutt\"\nShe said, \"Take your time, what's the rush?\"\nI said, \"Baby, I'm a dog, I'm a mutt\"\nI'm a dog, I'm a mutt\nNew crib, told her, \"Come through, \" it's time to break it in\n32 like my pants size 'cause a nigga tried breaking in\nNew condo, say your name at the front, you can stay if you want\nIt's been one of those nights, one of those nights I ain't had in a minute\nIt's been a minute, had to pop a shroom to recreate the feeling (ooh, yeah)\nBut it's never the same as the first time we did it\nFirst time we did it\nBut I'll let my guard down for you (for you)\nSaid I'll put my guard down for you\nSaid I'll be vulnerable\nSo you can break my heart if you want to (oh)\nShe said, \"Take your time, what's the rush?\" (take your time, what's the rush?)\nI said, \"Baby, I'm a dog, I'm a mutt\" (mutt, oh)\nShe said, \"Take your time, what's the rush?\" Oh (the rush, yeah, she like that)\nI said, \"Baby, I'm a dog, I'm a mutt\" (yeah, yeah, ooh)\nI'm a dog, I'm a mutt (yeah, yeah, yeah)\nWhy must I be like that every time I see the cat?\nChase it when I'm wasted, these bitches basic, but I'm a G like that\nTook a flight to London and brought two bitches from Ibiza back (whoo)\nIt's heating on them Afro-Latinas got me aphrodisiacs, I'm squeezing that\nKooky for that coochie, I'ma fiend for that\nSay, baby, I like it raw, go ODB with that\nAnd I knew you was a freak like that\nTryna lock me down, I'm just not peeping that\nThese goofy groupie hos is the reason that I'm still screaming, \"Where my dogs at?\" (roof)\nMutted out, slutted out\nFuck my girlfriend then I took my baby mother out\nReady for the winter time, I done smoked the summer out\nKept it in the family, my stripper ho brought her cousin out\nFetty never running out, Porsches and them Hummers out\nMoney showers caught my account and I spent a dumb amount\nNeighbors waking up while I'm fucking, like, what's the fuss about?\nI hit her while she say, \"Why you rushin' out?\"\nBaby, take your\nShe said, \"Take your time, what's the rush?\" (uh, yeah, why you rushing like that? Why you rushing like that? Take your time, what's the rush?)\nI said, \"Baby, I'm a dog, I'm a mutt\" (mutt, oh, why you rushing like that? Why you rushing like that? Yeah, yeah, yeah)\nShe said, \"Take your time, what's the rush?\" Oh (the rush, why you rushing like that? Why you rushing like that?)\nI said, \"Baby, I'm a dog, I'm a mutt\" (ooh)\nI'm a dog, I'm a mutt (mutt, oh, why must I be like that every time I see the cat?)\nYeah, why must I be like that every time I see the cat?\nRun it back\n"
    },
    {
        "rank": 11,
        "title": "Tears",
        "artist": "Sabrina Carpenter",
        "lyrics": "I get wet at the thought of you (Uh-huh)\nBeing a responsible guy\nTreating me like you're supposed to do (Uh-huh)\nTears run down my thighs\n\nA little initiative can go a very long, long way\nBaby, just do the dishes, I'll give you (What you, what you, what you want)\nA little communication, yes, that's my ideal foreplay\nAssemble a chair from IKEA, I'm like, \"Uh\" (Uh)\n\nI get wet at the thought of you (Uh-huh)\nBeing a responsible guy (So responsible)\nTreating me like you're supposed to do (Uh-huh)\nTears run down my thighs\n\nA little respect for women can get you very, very far\nRemembering how to use your phone gets me (Oh so, oh so, oh so hot)\nConsidering I have feelings, I'm like, \"Why are my clothes still on?\"\nOffering to do anything, I'm like, \"Oh my God\"\n\nI get wet at the thought of you (Uh-huh)\nBeing a responsible guy (So responsible)\nTreating me like you're supposed to do (Uh-huh)\nTears run down my thighs\n\nI get wet at the thought of you\nBeing a responsible guy\nTreating me like you're supposed to do\nTears run down my thighs\n\nDance break\nSo responsible\nOh\n\nI get wet at the thought of you (Uh-huh)\nBeing a responsible guy (So responsible)\nTreating me like you're supposed to do (Uh-huh)\nTears run down my thighs"
    },
    {
        "rank": 12,
        "title": "Sorry I'm Here For Someone Else",
        "artist": "Benson Boone",
        "lyrics": "I'm sorry I'm here for someone else\nBut it's good to see your face\nAnd I really hope you're doing well\nI hope you're doing well\nHere we go!\nOne, two, one, two, three\nShe was running late for dinner, south side of town\nLeft the phone a little bitter, but it's cool for now\nFar from perfect for each other, but we're working it out, I suppose (I suppose)\nNow I'm waiting at the diner looking traumatized\n'Cause you walk up to the table with an order of fries\nAnd I know ya, yes I know ya\nUsed to love you\nAnd I said\nI'm sorry I'm here for someone else\nIt's good to see your face\nAnd I really hope you're doing well\nI hope you're doing well\nI'm sorry I'm here for someone else\nI wish that I could stay\nTalk at the bar all by ourselves\nBut I'm here for someone else\n(Come on, what happened next, Benny?)\n(Yeah, come on)\nWhen she finally walks into the restaurant\nHate to say it, but I knew it I was already gone\nOh, Benny, don't do it\nYou're breaking her heart\nBenny, don't do it, Benny, don't do it\nBut I need to go (I need to go, I need to go)\nIt's not personal\nWhen I say\nI'm sorry I'm here for someone else\nIt's good to see your face\nAnd I really hope you're doing well\nI hope you're doing well\nI'm sorry I'm here for someone else\nI know you wish that I could stay\nTalk at the bar all by ourselves\nBut I'm here for someone else\nI'm still in love with you\nI'm going outta my mind\nI couldn't take it anymore\nI was already running for the kitchen doors\nYou were always the one I should've waited for\nI can't lose you again, not again, not again, not again"
    },
    {
        "rank": 13,
        "title": "Pink Pony Club",
        "artist": "Chappell Roan",
        "lyrics": "I know you wanted me to stay\nBut I can't ignore the crazy visions of me in LA\nAnd I heard that there's a special place\nWhere boys and girls can all be queens every single day\nI'm having wicked dreams of leaving Tennessee\nHear Santa Monica, I swear it's calling me\nWon't make my mama proud, it's gonna cause a scene\nShe sees her baby girl, I know she's gonna scream\nGod, what have you done?\nYou're a pink pony girl\nAnd you dance at the club\nOh mama, I'm just having fun\nOn the stage in my heels\nIt's where I belong down at the\nPink Pony Club\nI'm gonna keep on dancing at the\nPink Pony Club\nI'm gonna keep on dancing down in\nWest Hollywood\nI'm gonna keep on dancing at the\nPink Pony Club, Pink Pony Club\nI'm up and jaws are on the floor\nLovers in the bathroom and a line outside the door\nBlacklights and a mirrored disco ball\nEvery night's another reason why I left it all\nI thank my wicked dreams a year from Tennessee\nOh, Santa Monica, you've been too good to me\nWon't make my mama proud, it's gonna cause a scene\nShe sees her baby girl, I know she's gonna scream\nGod, what have you done?\nYou're a pink pony girl\nAnd you dance at the club\nOh mama, I'm just having fun\nOn the stage in my heels\nIt's where I belong down at the\nPink Pony Club\nI'm gonna keep on dancing at the\nPink Pony Club\nI'm gonna keep on dancing down in\nWest Hollywood\nI'm gonna keep on dancing at the\nPink Pony Club, Pink Pony Club\nDon't think I've left you all behind\nStill love you and Tennessee\nYou're always on my mind\nAnd mama, every Saturday\nI can hear your southern drawl a thousand miles away, saying\nGod, what have you done?\nYou're a pink pony girl\nAnd you dance at the club\nOh mama, I'm just having fun\nOn the stage in my heels\nIt's where I belong down at the\nPink Pony Club\nI'm gonna keep on dancing at the\nPink Pony Club\nI'm gonna keep on dancing down in\nWest Hollywood\nI'm gonna keep on dancing at the\nPink Pony Club, Pink Pony Club\nI'm gonna keep on dancing\nI'm gonna keep on dancing"
    },
    {
        "rank": 14,
        "title": "Jealous Type",
        "artist": "Doja Cat",
        "lyrics": "Boy, let me know if this is careless, I\nCould be torn between two roads that I just can't decide\nWhich one is leading me to Hell or paradise\nBaby, I can't hurt you, sure, but I'm the jealous type\nI'm the jealous type\n\nHe loves me\nBut he can't hold this above me\nWhen my eyes are green, I'm ugly\nYou're vain and hip to rushing\n\nI'm so overtired\nI will not wait in this line\nNever seen you cry\nYou're mine\n\nBoy, let me know if this is careless, I\nCould be torn between two roads that I just can't decide\nWhich one is leading me to Hell or paradise\nBaby, I can't hurt you, sure, but I'm the jealous type\nI'm the jealous type\n\nOh, I'm jealous\nBaby, I'm jealous\nOh, I'm jealous\nBaby, I'm the jealous type\nOh, I'm jealous\nBaby, I'm jealous\nSaid, oh, I'm jealous\nBaby, I'm the jealous type\n\nSaid, you wanna do what now with who?\nI don't need a pin drop or text tonight\nI ain't even coming out with you\nYou don't wanna show me off to your ex or your friends tonight\nNigga, you must be on Molly 'cause y'all ain't kick it when we started up\nAnd if she really was a friend like you said she was\nI would've been locked in, but I called your bluff\n\nNo girl enjoys trying to tough it out for a party boy\nEveryone wants you, and you love all the noise\nYou want what you can't have, but I made a choice\nI'm not your toy\n\nBoy, let me know if this is careless, I\nCould be torn between two roads that I just can't decide\nWhich one is leading me to Hell or paradise\nBaby, I can't hurt you, sure, but I'm the jealous type\nI'm the jealous type\n\nOh, I'm jealous\nBaby, I'm jealous\nOh, I'm jealous\nBaby, I'm the jealous type\nOh, I'm jealous\nBaby, I'm jealous\nSaid, oh, I'm jealous\nBaby, I'm the jealous type"
    },
    {
        "rank": 15,
        "title": "Nice To Meet You",
        "artist": "Myles Smith",
        "lyrics": "Lonely in this crowd, I sit alone, oh\nOne more drink away from heading home, oh\nOh, I could feel the night slipping by\nOh, away from me\nAnd, oh, she caught my eye through the light\nThen she came right up to me\nShe said, \"Oh, hi, nice to meet you\nTonight, maybe we could\nGo dance, get up off our feet\"\nShe said, \"This life ain't forever\nOne song, here together\nThen let's play it on repeat\"\nWe could dance, we could dance all night\nWe could dance 'til the morning light\nLet's forget about our worries and the wild world outside\nShe said, \"Oh, hi, nice to meet you\nTonight, maybe we could\nGo dance, get up off our feet\"\nWe could dance, we could dance all night\nShe took my hand and led me through the dark, oh\nShe said, \"Feel the beat, forget that broken heart\", oh\nAnd, oh, I can feel the night slipping by\nOh, away from me\nAnd, oh, I saw the light in her eyes\nGlad she came right up to me\nShe said, \"Oh, hi, nice to meet you\nTonight, maybe we could\nGo dance, get up off our feet\"\nShe said, \"This life ain't forever\nOne song, here together\nThen let's play it on repeat\"\nWe could dance, we could dance all night\nWe could dance 'til the morning light\nLet's forget about our worries and the wild world outside\nShe said, \"Oh, hi, nice to meet you\nTonight, maybe we could\nGo dance, get up off our feet\"\nWe could dance, we could dance all night\nWe could dance, we could dance all night\nShe said, \"Oh, hi, nice to meet you\nTonight, maybe we could\nGo dance, get up off our feet\"\nShe said, \"This life ain't forever\nOne song, here together\nThen let's play it on repeat\"\nWe could dance, we could dance all night"
    },
    {
        "rank": 16,
        "title": "Party 4 U",
        "artist": "Charli xcx",
        "lyrics": "I only threw this party for you\nOnly threw this party for you, for you, for you\nI was hopin' you would come through\nI was hopin' you would come through, it's true, it's true\nOnly threw this party for you\nI only threw this party for you, for you, for you\nI'm about to party on you\nWatch me, watch me party on you, yeah\n\n1000 pink balloons\nDJ with your favorite tunes\nBirthday cake in August\nBut you were born 19th of June\nChampagne pourin' in your mouth\nCalled your friends from out of town\nGot the party bag with the purple pills\nAnd I'm waiting for you by the window, yeah\nCalled your digits, but the phone kept ringin'\nWish I knew what you were thinking, na-na-na\n1000 pink balloons\nDancin' on to your favorite tunes\nHope you walk in the party\n'Cause I threw the party just for you like whoa\n\nI only threw this party for you\nOnly threw this party for you, for you, for you\nI was hopin' you would come through\nI was hopin' you would come through, it's true, it's true\nOnly threw this party for you\nI only threw this party for you, for you, for you\nI'm about to party on you\nWatch me, watch me party on you, yeah\n\nYou could watch me pull up on your body\nLike it's summer, take my clothes off\nIn the water, splash around and get you blessed like holy water\nI don't know what you were waiting for\nYou know that I've been waiting for you\nI only threw this party for you\nIf you saw my tears, would you touch me?\nKiss me on the mouth, say you love me?\nLeave a message, tell me you're sorry?\nHit me right back, hit me right back\nWhy you treating me like someone that you never loved?\n\nI only threw this party for you\nOnly threw this party for you, for you, for you\nI was hopin' you would come through\nI was hopin' you would come through, it's true, it's true\nOnly threw this party for you\nI only threw this party for you, for you, for you\nI'm about to party on you\nWatch me, watch me party on you, yeah\nI only threw this party for you\nOnly threw this party for you, for you, for you\nI was hopin' you would come through\nI was hopin' you would come through, it's true, it's true\nOnly threw this party for you\nI only threw this party for you, for you, for you\nI'm about to party on you\nWatch me, watch me party on you, yeah\n\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\n\nCome to my party (Party on you, party on you, party on)\n(Party on you, party on you, party on)\nCome to my party (Party on you, party on you, party on)\n(Party on you, party on you, party on)\nAll I'm thinking, all I know is (Party on you, party on you, party on)\nThat I hope you knock on my door (Party on you, party on you, party on)\nNervous energy (Party on you, party on you, party on)\nMy heart rate rises higher, higher up (Party on you, party on you, party on)\nI wish you'd get here, kiss my face (Party on you, party on you, party on)\nInstead, you're somewhere far away (Party on you, party on you, party on)\nMy nervous energy will stay (Party on you, party on you, party on)\nI hope you realize one day, uh (Party on you, party on you, party on)\n(Party on you, party on you, party on)\nCome to my party (Party on you, party on you, party on)\n(Party on you, party on you, party on)\nCome to my party (Party on you, party on you, party on)\n\nParty on you, party on you, party on\nParty on you, party on you, party on (Oh)\nParty on you, party on you, party on (Oh)\nParty on you, party on you, party on\nParty on you, party on you, party on (Ooh)\nParty on you, party on you, party on\nParty on you, party on you, party on (Oh)\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on\nParty on you, party on you, party on"
    },
    {
        "rank": 17,
        "title": "The Dead Dance",
        "artist": "Lady Gaga",
        "lyrics": "Like the words of a song, I hear you call\nLike a thief in my head, you criminal\nYou stole my thoughts before I dreamed them\nAnd you killed my queen with just one pawn\n\nThis goodbye is no surprise\nThis goodbye won't make me cry\n\nYeah, I'll keep on dancin' until I'm dead\nDancin' until I'm dead, I'm dancin' until I'm dead\nYeah, I'll keep on dancin' until I'm dead (Dead)\nI'll dance until I'm dead (Dead, dead, dead, dead)\n'Cause when you killed me inside, that's when I came alive\nYeah, the music's gonna bring me back from death\nI'm dancin' until I'm dead (Dead)\nI'll dance until I'm dead (Dead, dead, dead, dead)\n\nYou've created a creature of the night\nNow I'm haunting your air, your soul, your eyes\n\nThis goodbye is no surprise (Is no surprise)\nThis goodbye won't make me cry\n\nYeah, I'll keep on dancin' until I'm dead\nDancin' until I'm dead, I'm dancin' until I'm dead\nYeah, I'll keep on dancin' until I'm dead (Dead)\nI'll dance until I'm dead (Dead, dead, dead, dead)\n'Cause when you killed me inside, that's when I came alive\nYeah, the music's gonna bring me back from death\nI'm dancin' until I'm dead (Dead)\nI'll dance until I'm dead (Dead, dead, dead, dead)\n\nDo the dead dance (Dead)\nThe dead dance\nDo the dead dance (Dead)\nThe dead dance\nDo the dead dance (Dead)\nThe dead dance\nDo the dead dance (Dead)\nBut l'm alive on the dance floor\n\nAnd I'm dancin' until I'm dead (Dead)\nI'm dancin' until l'm dead, I'm dancin' until I'm dead\nYeah, I'll keep on dancin' until I'm dead (Dead)\nI'll dance until I'm dead\n'Cause when you killed me inside, that's when I came alive\nYeah, the music's gonna bring me back from death\nI'm dancin' until I'm dead (Dead)\nI'll dance until I'm dead\n\nDead (Dead, dead, dead, dead)"
    },
    {
        "rank": 18,
        "title": "All The Way",
        "artist": "BigXthaPlug Featuring Bailey",
        "lyrics": "Don't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way\nDon't ask for all your things back, cussin' out my name, yeah\nJust to go and take back what you say\nBurn all the bridges, don't ask forgiveness\nWalk away like I'm someone you hate\nDon't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way\nAy, if it's over, it's over, so fuck it, just don't act like my love wasn't nothin'\nLike I wasn't the one you was holdin' at night tellin' all of your secrets and huggin'\nGuess you right, it's too good to be true, what's the point? All I needed was you\nBut shit, time after time, all this fussin' and fightin', it's time that you do what you do\nAnd it's cool, mama said it was fish in the sea, I got lost in the pool\nKnew it was comin', I watched how you move, how you turn yo' back on me and leave me to lose?\nRemember the text, how you said that you'd do, said that you'd never leave, we would fight 'til it's due\nBut as it went on, I was fightin' for you, sent a text, it turned green, why the fuck it ain't blue?\nGuess you done and I get it\nSaid you'd stay, and you wanted my name, and you left, so I'm guessin' that you never meant it\nSaid you'd try and hold on 'cause the love was so strong, now I'm standin' alone this kitchen\nSingin' sad songs, but I'm knowin' that this shit don't last long\nIf you leavin', then leave 'cause yo' bags gone, but just know, you can never come back home\nDon't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way\nDon't ask for all your things back, cussin' out my name, yeah\nJust to go and take back what you say\nBurn all the bridges, don't ask forgiveness\nWalk away like I'm someone you hate\nDon't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way\nAy, if you say that you done, ain't no take backs, said you fell outta love and I hate that\nBut see me, I was stuck like a drug, really fiendin' for love and somehow, I can't shake back\nWhen you walked out that door, I was hurtin', all the dreams in my head, you was perfect\nYou remember the very first time that we chilled, and I reached for yo' hand, where them nerves at?\nTime'll pass and shit, that's what it do, it be times I be sick, sittin' thinkin' 'bout you\nIt was death do us part 'til you gave me the blues, really played my heart, left me lost and confused\nThought this shit was fair game, but you made up the rules, on my heart, left a scar and a bruise\nHope that you can stand on all the shit that you did 'cause I'm done, yeah, I'm finally through\nDon't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way\nDon't ask for all your things back, cussin' out my name, yeah\nJust to go and take back what you say\nBurn all the bridges, don't ask forgiveness\nWalk away like I'm someone you hate\nDon't let me down easy, if you're gonna leave me\nBaby, go and leave me all the way"
    },
    {
        "rank": 19,
        "title": "Cliche",
        "artist": "MGK",
        "lyrics": "Tell me, would you wait for me?\nBaby, I'm a rolling stone\nI got a lotta right in me\nBut I don't wanna say this wrong\nTell me, would you stay with me?\nBaby, we could make this home\nYou should run away with me\nEven if you're better off alone\nI liked that you liked me\nI kissed your lips, you got good taste\nI liked that you liked me\nI can close my eyes and draw your face\nIf you take this chance\nI'll give you oxygen to breath me in\nBut I'll say sorry in advance, mm\nMy head's a mess\nIt's like that every day and\nI'll try my best\nIt sounds cliché but\nTell me, would you wait for me?\nBaby, I'm a rolling stone\nI got a lotta right in me\nBut I don't wanna say this wrong\nTell me, would you stay with me?\nBaby, we could make this home\nYou should run away with me\nEven if you're better off alone\nYour name is in neon light in the sky when darkness surrounds us\nLet's leave this town, get married, go to Vegas and create nostalgia\nTell me, will you save this dance?\nI feel my knees get weak beneath me\nI know this night might be our last, mm\nMy head's a mess\nIt's like that every day and\nI'll try my best\nIt sounds cliché but\nTell me, would you wait for me?\nBaby, I'm a rolling stone\nI got a lotta right in me\nBut I don't wanna say this wrong\nTell me, would you stay with me?\nBaby, we could make this home\nYou should run away with me\nEven if you're better off alone\nTell me, would you wait, wait, wait, wait, wait for me?\nTell me, would you wait, wait, wait, wait, wait for me?\nTell me, would you wait for me?\nMm-mm\nBaby, I'm a rolling stone\nMm-mm\nI got a lotta right in me\nMm-mm\nBut I don't wanna say this wrong\nI don't wanna say this wrong, yeah\nTell me, would you wait for me?\nBaby, I'm a rolling stone\nI got a lotta right in me\nBut I don't wanna say this wrong (say this wrong)\nTell me, would you stay with me?\nBaby, we could make this home (make this home)\nYou should run away with me\nEven if you're better off alone\nTell me, would you wait, wait, wait, wait, wait for me?\nTell me, would you wait, wait, wait, wait, wait for me?\nWait for me"
    },
    {
        "rank": 20,
        "title": "Gabriela",
        "artist": "KATSEYE",
        "lyrics": "Hot like a bullet\nFlying too fast, I couldn't catch it\nHeart in the casket\nYou always knew it\nThe starring role, the main attraction\nGot cameras flashing\n\nLike, ooh\nYou got everybody's eyes undressing you\nAnd I see it too\nYeah, ooh\nYou could have anyone else you wanted to\nI'm begging you\n\nHands off, Gabriela, Gabriela\nHands off, Gabriela-la-la\nBack off of my fella, Gabriela\nBack off, Gabriela-la-la\n'Cause, ooh\nYou could have anyone else you wanted to\nI'm begging you (Hey)\nHands off, Gabriela, Gabriela\nHands off, Gabriela-la-la, la-la-la-la\n\nSkin amaretto\nI bet you taste just like the summer\nUnder the covers (Hey)\nMe in the middle\nOverprotective of my lover\nYou make me wonder\n\nLike, ooh\nIf you made all of these fantasies come true\nWhat would you do?\nYeah, ooh\nYou could have anyone else you wanted to\nBut I'm begging you\n\nHands off, Gabriela, Gabriela\nHands off, Gabriela-la-la\nBack off of my fella, Gabriela\nBack off, Gabriela-la-la\n'Cause, ooh\nYou could have anyone else you wanted to\nI'm begging you (Hey)\nHands off, Gabriela, Gabriela\nHands off, Gabriela-la-la, la-la-la-la\n\nLa-la-la-la\nLa-la-la-la\nLa-la-la-la (Oh, no)\n\nÉl llegó conmigo y conmigo se va\nSus ojos son mío', eso no va a cambiar\nMe quiere a mí y no importan las demás\nNo, no, no, no, no, no, no, no, no\nÉl llegó conmigo y conmigo se va\nSus ojos son mío', eso no va a cambiar\nMe quiere a mí y no importan las demás\nNo, no, no, no, no, no, no, no, no\n\nHands off, Gabriela, Gabriela\nHands off, Gabriela-la-la (Gabriela)\nBack off of my fella, Gabriela\nBack off, Gabriela-la-la (Oh, Gabriela-la-la)\n'Cause, ooh\nYou could have anyone else you wanted to\nI'm begging you (I'm begging you; Hey)\nHands off, Gabriela (Gabriela, hands off), Gabriela\nHands off (Hands off), Gabriela-la-la, la-la-la-la (La-la-la-la)\n\nLa-la-la-la (La-la-la-la)\nLa-la-la-la (La-la-la-la)\nLa-la-la-la\n(Back off, back off, back off)"
    }
]